Documents/Чек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>Чек</Name>
			<BasedOn>
				<xr:Item>Catalog.Заказ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСтола</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Официант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяСуммаЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаЕд</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Чек/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаказКоличествоПриИзменении(Элемент)
	ТаблицаЗаказ=Элементы.Заказ.ТекущиеДанные;
	ТаблицаЗаказ.Сумма=ТаблицаЗаказ.Количество*ТаблицаЗаказ.ЦенаЗаЕд;
	Объект.ИтоговаяСуммаЗаказа = Объект.Заказ.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ЗаказЦенаЗаЕдПриИзменении(Элемент)
	ТаблицаЗаказ=Элементы.Заказ.ТекущиеДанные;
	ТаблицаЗаказ.Сумма=ТаблицаЗаказ.Количество*ТаблицаЗаказ.ЦенаЗаЕд;
	Объект.ИтоговаяСуммаЗаказа = Объект.Заказ.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ЗаказСуммаПриИзменении(Элемент)
	ТаблицаЗаказ=Элементы.Заказ.ТекущиеДанные;
	ТаблицаЗаказ.Сумма=ТаблицаЗаказ.Количество*ТаблицаЗаказ.ЦенаЗаЕд;
	Объект.ИтоговаяСуммаЗаказа = Объект.Заказ.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	Объект.ИтоговаяСуммаЗаказа = Объект.Заказ.Итог("Сумма");
	КонецПроцедуры
